[
  {
    "id": "lahmacun",
    "type": "Meal",
    "title": "Homemade Turkish lahmacun",
    "description": "Sometimes called 'Turkish pizza', this crispy flatbread topped with spiced mincemeat is a popular street food across the Middle East",
    "image": "lahmacun.png",
    "stars": 5,
    "comments": [
      {
        "username": "Husan",
        "comment": "What an incredible dish, completely convenient for 4-person family!"
      },
      {
        "username": "Zeynep",
        "comment": "It was good to prepare a food that you enjoy eating outside at home!"
      }
    ],
    "prep": "40 mins",
    "time": "15 mins",
    "difficulity": "Easy",
    "serves": 4,
    "nutrition": {
      "kcal": 682,
      "fat": 18,
      "saturates": 6,
      "carbs": 98,
      "sugars": 4,
      "fibre": 6,
      "protein": 40,
      "salt": 2.61
    },
    "ingredients": [
      "3 aubergines",
      "2 tbsp olive oil, plus extra for brushing",
      "1 Spanish onion, finely chopped",
      "2 garlic cloves, crushed",
      "1 tsp cinnamon",
      "8 ripe tomatoes, peeled",
      "small bunch flat-leaf parsley, chopped",
      "12 lamb chops or cutlets",
      "paprika, for seasoning",
      "1 lemon, halved"
    ],
    "steps": [
      "Sift the flour into a large bowl, make a well in the middle and sprinkle in the yeast. Pour 125ml water over the yeast, then flick flour over the liquid to create a layer. Cover and leave to rise in a warm place for 15 mins until cracks appear on the surface of that layer.",
      "Use your hands to mix in 250ml more water along with 1 tsp salt and knead the dough for about 10 mins until elastic and no longer sticky. Add a little more flour if you need to. Cover and leave to rise again in a warm place for 30 mins until doubled in size.",
      "Heat the oven to as high as it will go (about 240C/220C fan/gas 9) and sprinkle one or two baking trays thinly with cornmeal.",
      "Pour boiling water from the kettle over the tomatoes, leave to stand briefly, then drain and slip off the skins. Cut the tomatoes in half, cut out the stalks, scoop out the seeds and discard, then chop the flesh.",
      "Halve the chillies lengthways, cut out the stalks, seeds and white inner membrane, then rinse. Cut lengthwise into fine strips, then crosswise into fine dice.",
      "Put the tomatoes, chillies, spring onions, finely chopped parsley, beef mince, spices, 1 tsp salt and ½ tsp freshly ground black pepper into a bowl and mix well.",
      "Take the dough and knead it briefly, then divide into four pieces and shape each into a ball. Roll each ball into a thin circle, place on the prepared baking trays. Spread with a thin layer of the meat mixture.",
      "Bake each flatbread for 10-15 mins until the edges begin to darken. After removing from the oven, sprinkle the lahmacun with the roughly chopped parsley and sliced onion, then squeeze over a few drops of lemon juice. Serve straightaway."
    ]
  },
  {
    "id": "imam-bayildi",
    "type": "Meal",
    "title": "Imam Bayildi with BBQ Lamb & Tzatziki",
    "description": "There are hundreds of versions of this Turkish aubergine dish. It is authentically quite oily, but reduce the oil if you prefer.",
    "image": "imam-bayildi.png",
    "stars": 4.5,
    "comments": [
      {
        "username": "Mine",
        "comment": "Made the aubergines as a vegetarian main. Went down very well at a family gathering. Made them the day before and that worked well too. Would definitely make again."
      },
      {
        "username": "Ilkay",
        "comment": "This is really delicious and gets a lot of compliments. I served it with tzatziki and keftas. Not sure why they ask you to cook it until the aubergines 'collapse' - the skins are pretty collapsed after you've chopped out the flesh in step 2. I didn't bother peeling or de-seeding teh tomatoes, but just chopped them up and added them all in at once. It may have been a bit more 'rustic' but it was lovely!"
      },
      {
        "username": "Batuhan",
        "comment": "I have cooked this twice and have been really disappointed with the lack of depth of flavour of the aubergine dish Even added a bit of tomato puree to the ripe tomatoes second time around whilst cooking to try to bring out a bit more flavour."
      }
    ],
    "prep": "15 mins",
    "time": "1 hr and 30 mins",
    "difficulity": "Easy",
    "serves": 6,
    "nutrition": {
      "kcal": 435,
      "fat": 32,
      "saturates": 14,
      "carbs": 12,
      "sugars": 10,
      "fibre": 5,
      "protein": 27,
      "salt": 5
    },
    "ingredients": [
      "3 aubergines",
      "2 tbsp olive oil, plus extra for brushing",
      "1 Spanish onion, finely chopped",
      "2 garlic cloves, crushed",
      "1 tsp cinnamon",
      "8 ripe tomatoes, peeled",
      "small bunch flat-leaf parsley, chopped",
      "12 lamb chops or cutlets",
      "paprika, for seasoning",
      "1 lemon, halved"
    ],
    "steps": [
      "Heat oven to 190C/170C fan/gas 5. Halve the aubergines lengthways and score the flesh side deeply, brush with a good layer of olive oil and put on a baking sheet. Roast for 20 mins or until the flesh is soft enough to scoop out.",
      "Fry the onion in a little oil until soft, add the garlic and cinnamon and fry for 1 min. Once the aubergines are cool enough to handle, scoop out the centres. Roughly chop the flesh and add it to the onions. Halve the tomatoes, scoop the seeds and juice into a sieve set over a bowl, then chop the flesh. Add the chopped tomatoes to the pan and cook everything for 10 mins until nice and soft. Add a little more oil if you need to. Stir in the parsley, leaving a little for scattering at the end.",
      "Lay the aubergine halves in a baking dish and divide the tomato mixture between them. Pour over the juice from the tomatoes, drizzle with more olive oil and bake for 30 mins until the aubergines have collapsed.",
      "Meanwhile, mix the tzatziki ingredients together and put in a small serving bowl.",
      "Season the lamb with salt, black pepper and a pinch of paprika. Griddle, grill or barbecue for 3 mins on each side or until the fat is nicely browned, then put in a serving dish and squeeze over the lemon halves. Scatter the aubergines with parsley, then serve with the lamb and tzatziki."
    ]
  },
  {
    "id": "lamb-pilav",
    "type": "Meal",
    "title": "Turkish Lamb Pilav",
    "description": "Serve up a basmati rice one pot flavoured with cinnamon, mint and apricot, studded with tender lamb.",
    "image": "lamb-pilav.png",
    "stars": 4.8,
    "comments": [
      {
        "username": "Asım",
        "comment": "If I could give the slow cooker recipe zero, I would. Absolute slop, £15 of lamb went in the recycle bin. Take it down and never write another recipe."
      },
      {
        "username": "Yiğit",
        "comment": "My friends just loved it, thanks!"
      },
      {
        "username": "Batuhan",
        "comment": "I have cooked this twice and have been really disappointed with the lack of depth of flavour of the aubergine dish Even added a bit of tomato puree to the ripe tomatoes second time around whilst cooking to try to bring out a bit more flavour."
      }
    ],
    "prep": "10 mins",
    "time": "30 mins",
    "difficulity": "Easy",
    "serves": 4,
    "nutrition": {
      "kcal": 584,
      "fat": 24,
      "saturates": 9,
      "carbs": 65,
      "sugars": 0,
      "fibre": 3,
      "protein": 32,
      "salt": 1.4
    },
    "ingredients": [
      "small handful pine nuts or flaked almonds",
      "1 tbsp olive oil",
      "1 large onion, halved and sliced",
      "2 cinnamon sticks, broken in half",
      "500g lean lamb neck fillet, cubed",
      "250g basmati rice",
      "1 lamb or vegetable stock cube",
      "12 ready-to-eat dried apricots",
      "handful fresh mint leaves, roughly chopped"
    ],
    "steps": [
      "Dry-fry the pine nuts or almonds in a large pan until lightly toasted, then tip onto a plate. Add the oil to the pan, then fry the onion and cinnamon together until starting to turn golden. Turn up the heat, stir in the lamb, fry until the meat changes colour, then tip in the rice and cook for 1 min, stirring all the time.",
      "Pour in 500ml boiling water, crumble in the stock cube, add the apricots, then season to taste. Turn the heat down, cover and simmer for 12 mins until the rice is tender and the stock has been absorbed. Toss in the pine nuts and mint and serve."
    ]
  },
  {
    "id": "almond-pastries",
    "type": "Dessert",
    "title": "Almond & Honey Pastries with Orange Cream",
    "description": "Serve these prepare-ahead puds with coffee, dessert wine or fresh mint tea for a real after-dinner treat.",
    "image": "almond-pastries.png",
    "stars": 4.1,
    "comments": [
      {
        "username": "Mine",
        "comment": "Made the aubergines as a vegetarian main. Went down very well at a family gathering. Made them the day before and that worked well too. Would definitely make again."
      },
      {
        "username": "Ilkay",
        "comment": "This is really delicious and gets a lot of compliments. I served it with tzatziki and keftas. Not sure why they ask you to cook it until the aubergines 'collapse' - the skins are pretty collapsed after you've chopped out the flesh in step 2. I didn't bother peeling or de-seeding teh tomatoes, but just chopped them up and added them all in at once. It may have been a bit more 'rustic' but it was lovely!"
      },
      {
        "username": "Batuhan",
        "comment": "I have cooked this twice and have been really disappointed with the lack of depth of flavour of the aubergine dish Even added a bit of tomato puree to the ripe tomatoes second time around whilst cooking to try to bring out a bit more flavour."
      }
    ],
    "prep": "45 mins",
    "time": "15 mins",
    "difficulity": "More Effort",
    "serves": 12,
    "nutrition": {
      "kcal": 397,
      "fat": 32,
      "saturates": 14,
      "carbs": 12,
      "sugars": 13,
      "fibre": 5,
      "protein": 7,
      "salt": 0.26
    },
    "ingredients": [
      "200g whole blanched almond, toasted and roughly chopped",
      "85g icing sugar, plus extra to serve",
      "85g butter, melted",
      "2 tsp orange flower water",
      "1 tsp cinnamon",
      "1 egg yolk",
      "190g pack brik pastry",
      "clear honey, to serve",
      "zest 1 orange",
      "300g Greek yogurt",
      "300ml tub double cream",
      "2 tbsp icing sugar, sifted"
    ],
    "steps": [
      "Set aside a quarter of the almonds. Put the rest in a food processor with the icing sugar, half the butter, orange blossom water, cinnamon and egg yolk. Whizz to a paste. Scrape into a bowl and stir in most of the remaining chopped nuts.",
      "Unroll one sheet of brik pastry at a time, brush all over with melted butter and halve into 2 semi-circles. Shape 1 heaped tbsp of the nut mixture to look like a thin wedge shape along half the pastry edge you’ve just cut (leaving 2.5cm border on the rounded side), so it looks as if you’re cutting the semi-circle of pastry into pieces like a cake. Roll up like a pastry cone, sealing the nut mixture inside, then brush all over with more butter and fold over the open, wide end to seal. Sit on a baking tray, end flap side down to help it stay closed, and repeat until nut mixture is used up. Cover with cling film and chill. Put zest, yogurt, cream and icing sugar in a mixing bowl. Cover and chill.",
      "Heat oven to 200C/180C fan/gas 6, put the pastries in and bake for 15 mins until golden and crisp. Just before they’re ready, beat together the yogurt mixture until thick. Pile pastries onto a serving dish, drizzle with honey and scatter with remaining nuts. Serve with the orange cream and Honeyed orange & grapefruit (see 'Goes well with')."
    ]
  },
  {
    "id": "hummus",
    "type": "Side-dish",
    "title": "Hummus",
    "description": "A smooth blended chickpea dip with tahini and garlic that's versatile and good for you, this easy hummus makes a great snack or lunch.",
    "image": "hummus.png",
    "stars": 4.4,
    "comments": [
      {
        "username": "Mine",
        "comment": "Made the aubergines as a vegetarian main. Went down very well at a family gathering. Made them the day before and that worked well too. Would definitely make again."
      },
      {
        "username": "Ilkay",
        "comment": "This is really delicious and gets a lot of compliments. I served it with tzatziki and keftas. Not sure why they ask you to cook it until the aubergines 'collapse' - the skins are pretty collapsed after you've chopped out the flesh in step 2. I didn't bother peeling or de-seeding teh tomatoes, but just chopped them up and added them all in at once. It may have been a bit more 'rustic' but it was lovely!"
      },
      {
        "username": "Batuhan",
        "comment": "I have cooked this twice and have been really disappointed with the lack of depth of flavour of the aubergine dish Even added a bit of tomato puree to the ripe tomatoes second time around whilst cooking to try to bring out a bit more flavour."
      }
    ],
    "prep": "5 mins",
    "time": "no cook :)",
    "difficulity": "Easy",
    "serves": 4,
    "nutrition": {
      "kcal": 135,
      "fat": 32,
      "saturates": 14,
      "carbs": 12,
      "sugars": 1.3,
      "fibre": 5,
      "protein": 7.5,
      "salt": 0.5
    },
    "ingredients": [
      "1 x 400g can chickpea, don't drain",
      "1 tbsp tahini paste",
      "1 fat garlic clove, chopped",
      "3 tbsp 0% fat Greek yogurt",
      "good squeeze lemon juice"
    ],
    "steps": [
      "Drain the chickpeas into a sieve set over a bowl or jug to catch the liquid. Tip the chickpeas, tahini, garlic and yogurt into a food processor or blender and whizz to smooth.",
      "Whizz in a tbsp of the chickpea liquid at a time until you have a nice consistency, then scrape into a bowl.",
      "Stir in a squeeze of lemon juice and season to taste."
    ]
  },
  {
    "id": "baklava",
    "type": "Dessert",
    "title": "Baklava with Spiced Nuts, Ricotta & Chocolate",
    "description": "Make some burma-style baklava from Turkey with spiced nuts, ricotta and chocolate.",
    "image": "baklava.png",
    "stars": 4.8,
    "comments": [
      {
        "username": "Mine",
        "comment": "Made the aubergines as a vegetarian main. Went down very well at a family gathering. Made them the day before and that worked well too. Would definitely make again."
      },
      {
        "username": "Ilkay",
        "comment": "This is really delicious and gets a lot of compliments. I served it with tzatziki and keftas. Not sure why they ask you to cook it until the aubergines 'collapse' - the skins are pretty collapsed after you've chopped out the flesh in step 2. I didn't bother peeling or de-seeding teh tomatoes, but just chopped them up and added them all in at once. It may have been a bit more 'rustic' but it was lovely!"
      },
      {
        "username": "Batuhan",
        "comment": "I have cooked this twice and have been really disappointed with the lack of depth of flavour of the aubergine dish Even added a bit of tomato puree to the ripe tomatoes second time around whilst cooking to try to bring out a bit more flavour."
      }
    ],
    "prep": "45 mins",
    "time": "1 hr and 5 mins",
    "difficulity": "Chef",
    "serves": 24,
    "nutrition": {
      "kcal": 362,
      "fat": 16,
      "saturates": 14,
      "carbs": 12,
      "sugars": 120,
      "fibre": 5,
      "protein": 5,
      "salt": 0.1
    },
    "ingredients": [
      "500g sugar",
      "lemon juice, to taste",
      "300g walnuts",
      "200g pecans",
      "100g almonds",
      "2 tbsp ground cinnamon",
      "1 tsp ground cardamom",
      "500g ricotta",
      "1 lemon, zested",
      "1 orange or clementine, zested",
      "1 tbsp vanilla bean paste",
      "250g unsalted butter",
      "500g pack filo pastry",
      "150g dark chocolate",
      "100g finely ground pistachios (I use Iranian pistachios)"

    ],
    "steps": [
      "First, make the syrup. Tip the sugar into a large saucepan with 650ml water. Stir over a low heat until the sugar has dissolved, then turn up the heat and bring to the boil. Reduce the heat to a simmer and cook for 15 mins, then squeeze in a few drops of lemon juice and simmer for a further 5 mins. Remove from the heat and leave to cool. Meanwhile, for assembling the baklava later, melt the butter in a small pan over a low heat for 5 mins, skimming and discarding any froth that rises to the surface.",
      "For the filling, crush all of the nuts in a pestle and mortar, or blitz in a food processor – you want a mixture of finely ground nuts with a few chunky pieces. Tip into a bowl, stir through the spices and set aside.",
      "In a separate bowl, mix the ricotta with the lemon and orange zests and vanilla. Heat the oven to 180C/160C fan/gas 4. Brush the bottom of a large baking tray (about 35 x 47cm) with some of the melted butter. Working with one sheet of filo at a time (covering the rest with a damp tea towel to prevent it drying out), lay the sheet out on a board so one of the short ends is facing you. Sprinkle 30g of the nut mixture evenly over the whole sheet, then spoon 1 tbsp of the ricotta mixture across the end closest to you. Fold this end over to enclose the filling, then lay a long, thin skewer next to the folded edge and roll the pastry around it to create a long roll. When it’s fully rolled up, it should be roughly the thickness of a chipolata sausage. While holding one end of the rolling pin or skewer, gently scrunch the filo roll like an accordion and carefully push it off the skewer and onto the prepared tray. Repeat with the rest of the filo and fillings – you should get about 12 rolls. Cut each roll into four to make 48 large baklava, or eight to make 96 mini.",
      "Brush with the remaining melted butter. Bake for 20-25 mins until evenly golden, turning the tray around halfway through. While still hot, immediately pour over 5-6 ladlefuls of the syrup. You should hear the syrup sizzle as it hits the hot baklava. Set aside to cool and absorb.",
      "Melt the dark chocolate in a heatproof bowl set over a pan of simmering water, ensuring the bowl doesn’t touch the water, or in the microwave in short bursts. Drizzle this over the cooled baklava and sprinkle with the ground pistachios."
    ]
  }
]

